{
  "The Big Bang Theory": {
    "Season 1": [
      {
        "Episode 1": {
          "Title": "Pilot",
          "Description": "A pair of socially awkward theoretical physicists meet their new neighbor Penny, who is their polar opposite."
        }
      },
      {
        "Episode 2": {
          "Title": "The Big Bran Hypothesis",
          "Description": "Penny is furious with Leonard and Sheldon when they sneak into her apartment and clean it while she is sleeping."
        }
      },
      {
        "Episode 3": {
          "Title": "The Fuzzy Boots Corollary",
          "Description": "Leonard gets upset when he discovers that Penny is seeing a new guy, so he tries to trick her into going on a date with him."
        }
      },
      {
        "Episode 4": {
          "Title": "The Luminous Fish Effect",
          "Description": "Sheldon's mother is called to intervene when he delves into numerous obsessions after being fired for being disrespectful to his new boss."
        }
      },
      {
        "Episode 5": {
          "Title": "The Hamburger Postulate",
          "Description": "Leslie seduces Leonard, but afterwards tells him that she is only interested in a one-night stand."
        }
      },
      {
        "Episode 6": {
          "Title": "The Middle-Earth Paradigm",
          "Description": "The guys are invited to Penny's Halloween party, where Leonard has yet another run-in with Penny's ex-boyfriend Kurt."
        }
      },
      {
        "Episode 7": {
          "Title": "The Dumpling Paradox",
          "Description": "When Howard hooks up with Penny's old friend, his absence in the gang causes problems for the rest of the guys."
        }
      },
      {
        "Episode 8": {
          "Title": "The Grasshopper Experiment",
          "Description": "When Raj's parents set him up on a blind date, he finds he can talk to women with the aid of alcohol."
        }
      },
      {
        "Episode 9": {
          "Title": "The Cooper-Hofstadter Polarization",
          "Description": "Leonard and Sheldon's friendship is put to the test when Leonard wants to present a paper they co-authored at a physics convention, but Sheldon doesn't."
        }
      },
      {
        "Episode 10": {
          "Title": "The Loobenfeld Decay",
          "Description": "Leonard lies to Penny so he and Sheldon can get out of watching her perform, but Sheldon believes that the lie has too many loose ends, so he comes up with a new, unnecessarily complex one to replace it."
        }
      },
      {
        "Episode 11": {
          "Title": "The Pancake Batter Anomaly",
          "Description": "When Sheldon gets sick, Leonard, Howard and Raj go AWOL, leaving a reluctant Penny to deal with him."
        }
      },
      {
        "Episode 12": {
          "Title": "The Jerusalem Duality",
          "Description": "Sheldon decides to give up his work and focus on other tasks when a 15-year-old prodigy joins the university, so the other guys come up with a plan to get rid of him."
        }
      },
      {
        "Episode 13": {
          "Title": "The Bat Jar Conjecture",
          "Description": "Sheldon becomes so intent on demonstrating his intellectual superiority over the other guys that they kick him off the Physics Bowl team and replace him with his nemesis, Leslie."
        }
      },
      {
        "Episode 14": {
          "Title": "The Nerdvana Annihilation",
          "Description": "Penny gets mad at the guys when their full scale model of a time machine causes her to miss work, which prompts Leonard to give up all of his nerd memorabilia."
        }
      },
      {
        "Episode 15": {
          "Title": "The Porkchop Indeterminacy",
          "Description": "Leonard, Howard and Raj fight over Sheldon's twin sister when she arrives in town. Raj takes part in a drug trial to suppress his selective mutism."
        }
      },
      {
        "Episode 16": {
          "Title": "The Peanut Reaction",
          "Description": "When Penny learns that Leonard has never had a birthday party, she and the rest of the guys plan a surprise party for him."
        }
      },
      {
        "Episode 17": {
          "Title": "The Tangerine Factor",
          "Description": "After a bad breakup, Penny finally agrees to go out on a date with Leonard, however they both develop doubts and turn to Sheldon for advice."
        }
      }
    ],
    "Season 2": [
      {
        "Episode 1": {
          "Title": "The Bad Fish Paradigm",
          "Description": "Leonard becomes concerned when his date with Penny ends abruptly and she starts blowing him off. When told the truth, Sheldon would rather move out than keep Penny's reasons a secret from Leonard."
        }
      },
      {
        "Episode 2": {
          "Title": "The Codpiece Topology",
          "Description": "Sheldon is annoyed when Leonard turns to Leslie for comfort after seeing Penny with another guy."
        }
      },
      {
        "Episode 3": {
          "Title": "The Barbarian Sublimation",
          "Description": "Sheldon introduces Penny to online gaming, however she refuses to quit after becoming addicted."
        }
      },
      {
        "Episode 4": {
          "Title": "The Griffin Equivalency",
          "Description": "The guys struggle to cope with Raj's arrogance after he is featured in a People magazine article."
        }
      },
      {
        "Episode 5": {
          "Title": "The Euclid Alternative",
          "Description": "Sheldon annoys the gang when Leonard can't drive him to and from work, so they try to teach him how to drive."
        }
      },
      {
        "Episode 6": {
          "Title": "The Cooper-Nowitzki Theorem",
          "Description": "Sheldon is flattered when a graduate student takes a shine to him, however her extreme devotion becomes too much to handle."
        }
      },
      {
        "Episode 7": {
          "Title": "The Panty Piñata Polarization",
          "Description": "Penny plans revenge when Sheldon bans her from his and Leonard's apartment, while Howard and Raj use the latest technology to try to find the house being used in 'America's Next Top Model.'"
        }
      },
      {
        "Episode 8": {
          "Title": "The Lizard-Spock Expansion",
          "Description": "Leonard and Howard's friendship is jeopardised when Leonard steals a girl from Howard."
        }
      },
      {
        "Episode 9": {
          "Title": "The White Asparagus Triangulation",
          "Description": "Sheldon believes that Leonard will wreck his relationship with Stephanie, so he decides to take matters into his own hands."
        }
      },
      {
        "Episode 10": {
          "Title": "The Vartabedian Conundrum",
          "Description": "Leonard tries to slow down his relationship with Stephanie when he realizes that they are living together, while Sheldon becomes convinced that he has an untraceable disease."
        }
      },
      {
        "Episode 11": {
          "Title": "The Bath Item Gift Hypothesis",
          "Description": "Leonard is disappointed when Penny develops an interest in an attractive physicist at the university. Meanwhile, Sheldon struggles to find an appropriate Christmas gift for Penny."
        }
      },
      {
        "Episode 12": {
          "Title": "The Killer Robot Instability",
          "Description": "Howard becomes depressed after Penny makes a cruel statement about his love life, while the rest of the guys prepare for a grudge killer robot duel against an obnoxious colleague at the university."
        }
      },
      {
        "Episode 13": {
          "Title": "The Friendship Algorithm",
          "Description": "Sheldon tries to make friends with Kripke in the hope that it will get him access to a coveted computer at the university."
        }
      },
      {
        "Episode 14": {
          "Title": "The Financial Permeability",
          "Description": "Leonard and Sheldon try to help out Penny when she can't afford to pay her rent."
        }
      },
      {
        "Episode 15": {
          "Title": "The Maternal Capacitance",
          "Description": "Sheldon hits it off with Leonard's psychoanalyst mother, but she drives Leonard and Penny to the bottle."
        }
      },
      {
        "Episode 16": {
          "Title": "The Cushion Saturation",
          "Description": "Howard hooks up with Leslie, while Penny accidentally ruins Sheldon's spot on the couch."
        }
      },
      {
        "Episode 17": {
          "Title": "The Terminator Decoupling",
          "Description": "On a train to San Francisco, Howard, Raj and Leonard fight for the affections of sci-fi star Summer Glau, while Sheldon is forced to turn to Penny for help when he leaves his flash drive behind."
        }
      },
      {
        "Episode 18": {
          "Title": "The Work Song Nanocluster",
          "Description": "Sheldon's assistance with Penny's home-based business leads to chaos."
        }
      },
      {
        "Episode 19": {
          "Title": "The Dead Hooker Juxtaposition",
          "Description": "Penny becomes jealous when a gorgeous new neighbor attracts the guys' attention."
        }
      },
      {
        "Episode 20": {
          "Title": "The Hofstadter Isotope",
          "Description": "Leonard is upset when the owner of the comic book store goes on a date with Penny, so he convinces Howard and Raj to take him to a bar so that he can pick up a woman of his own."
        }
      },
      {
        "Episode 21": {
          "Title": "The Vegas Renormalization",
          "Description": "After being dumped by Leslie, Howard heads to Las Vegas with Leonard and Raj. Meanwhile, Penny is forced to take in Sheldon after he locks himself out of his apartment."
        }
      },
      {
        "Episode 22": {
          "Title": "The Classified Materials Turbulence",
          "Description": "Penny's second date with Stuart has significant implications for Leonard. Howard enlists the guys' help with one of his NASA projects."
        }
      },
      {
        "Episode 23": {
          "Title": "The Monopolar Expedition",
          "Description": "Penny gets upset when she finds out Leonard and the guys plan to work at the North Pole for the summer."
        }
      }
    ],
    "Season 3": [
      {
        "Episode 1": {
          "Title": "The Electric Can Opener Fluctuation",
          "Description": "After returning from the North Pole, a conflict among the guys sends Sheldon back to Texas and interferes with Leonard's reunion with Penny."
        }
      },
      {
        "Episode 2": {
          "Title": "The Jiminy Conjecture",
          "Description": "Leonard and Penny's first night together goes awkwardly. Sheldon and Howard wager on the species of a cricket."
        }
      },
      {
        "Episode 3": {
          "Title": "The Gothowitz Deviation",
          "Description": "Sheldon attempts to covertly alter Penny's habits, while Howard and Raj try their luck meeting women at a Goth-style club."
        }
      },
      {
        "Episode 4": {
          "Title": "The Pirate Solution",
          "Description": "When Raj has to find a new job or be sent back to India, Sheldon's solution leaves Leonard and Penny dealing with Howard as the third wheel."
        }
      },
      {
        "Episode 5": {
          "Title": "The Creepy Candy Coating Corollary",
          "Description": "Leonard is forced to ask Penny to set Howard up with one of her friends, while Sheldon seeks payback against sci-fi star Wil Wheaton.."
        }
      },
      {
        "Episode 6": {
          "Title": "The Cornhusker Vortex",
          "Description": "Leonard tries to learn about football to fit in with Penny's friends. Meanwhile, a loss in a kite war threatens to end Raj and Howard's friendship."
        }
      },
      {
        "Episode 7": {
          "Title": "The Guitarist Amplification",
          "Description": "Sheldon is caught in the middle when Leonard and Penny argue about Penny's friend staying at her apartment."
        }
      },
      {
        "Episode 8": {
          "Title": "The Adhesive Duck Deficiency",
          "Description": "Penny is forced to turn to Sheldon for help when she dislocates her shoulder in the bathtub. Meanwhile, the rest of the guys accidentally get stoned in the desert while waiting for a meteor shower."
        }
      },
      {
        "Episode 9": {
          "Title": "The Vengeance Formulation",
          "Description": "Sheldon plans revenge after Kripke humiliates him on the radio. Howard develops doubts about his relationship with Bernadette."
        }
      },
      {
        "Episode 10": {
          "Title": "The Gorilla Experiment",
          "Description": "Sheldon attempts to help Penny understand physics to impress Leonard, while Howard becomes jealous when Bernadette takes an interest in Leonard's research."
        }
      },
      {
        "Episode 11": {
          "Title": "The Maternal Congruence",
          "Description": "Leonard's mother makes a visit to his dismay and Sheldon's delight."
        }
      },
      {
        "Episode 12": {
          "Title": "The Psychic Vortex",
          "Description": "Raj talks Sheldon into being his wingman at a university mixer. Leonard has trouble dealing with Penny consulting a psychic."
        }
      },
      {
        "Episode 13": {
          "Title": "The Bozeman Reaction",
          "Description": "When their apartment is robbed, Leonard and Sheldon turn to Howard and Raj to create a state-of-the-art security system."
        }
      },
      {
        "Episode 14": {
          "Title": "The Einstein Approximation",
          "Description": "Sheldon wreaks havoc when he is stumped by a difficult physics question."
        }
      },
      {
        "Episode 15": {
          "Title": "The Large Hadron Collision",
          "Description": "When Leonard is offered a trip to Switzerland on Valentine's Day to visit the CERN laboratory, Sheldon uses any and all means to be his guest instead of Penny."
        }
      },
      {
        "Episode 16": {
          "Title": "The Excelsior Acquisition",
          "Description": "Sheldon misses an opportunity to get Stan Lee's autograph because he has to make an appearance in traffic court."
        }
      },
      {
        "Episode 17": {
          "Title": "The Precious Fragmentation",
          "Description": "The guys' friendship is threatened when they find a ring from the 'Lord of the Rings' trilogy."
        }
      },
      {
        "Episode 18": {
          "Title": "The Pants Alternative",
          "Description": "Sheldon seeks help from the rest of the gang in overcoming his fear of public speaking when he receives an award."
        }
      },
      {
        "Episode 19": {
          "Title": "The Wheaton Recurrence",
          "Description": "Sheldon takes on Wil Wheaton in a game of bowling. Leonard and Penny's relationship comes to a crossroad."
        }
      },
      {
        "Episode 20": {
          "Title": "The Spaghetti Catalyst",
          "Description": "Sheldon is forced to go behind Leonard's back to spend time with Penny following their breakup."
        }
      },
      {
        "Episode 21": {
          "Title": "The Plimpton Stimulation",
          "Description": "Chaos ensues when a nymphomaniac physicist visiting Sheldon hooks up with Leonard."
        }
      },
      {
        "Episode 22": {
          "Title": "The Staircase Implementation",
          "Description": "Leonard tells Penny about how he and Sheldon became roommates and what happened to the elevator."
        }
      },
      {
        "Episode 23": {
          "Title": "The Lunar Excitation",
          "Description": "Penny has a night of angry, drunken sex with Leonard, much to his confusion. Meanwhile, Howard and Raj search for Sheldon's perfect match online."
        }
      }
    ],
    "Season 4": [
      {
        "Episode 1": {
          "Title": "The Robotic Manipulation",
          "Description": "Penny ends up tagging along on Sheldon's first ever date with Amy, while Howard finds an unusual use for a robotic arm."
        }
      },
      {
        "Episode 2": {
          "Title": "The Cruciferous Vegetable Amplification",
          "Description": "When Sheldon calculates the technology to download his consciousness into a robot won't be invented soon enough, he desperately tries to find a way to increase his lifespan."
        }
      },
      {
        "Episode 3": {
          "Title": "The Zazzy Substitution",
          "Description": "Following his 'breakup' with Amy, the gang become concerned with Sheldon's obsessive search for non-human companionship and call his mother to intervene."
        }
      },
      {
        "Episode 4": {
          "Title": "The Hot Troll Deviation",
          "Description": "Howard tries to get Penny's help in winning back Bernadette, but first has to confess the embarrassing reason why they broke up in the first place. Raj and Sheldon clash over a desk."
        }
      },
      {
        "Episode 5": {
          "Title": "The Desperation Emanation",
          "Description": "Sheldon is scared that he is in a relationship when Amy asks him to meet her mother, and Leonard asks Howard and Bernadette to set him up because he is the only person in the group without a girlfriend."
        }
      },
      {
        "Episode 6": {
          "Title": "The Irish Pub Formulation",
          "Description": "Leonard tries to keep everyone from finding out that he spent the night with Raj's sister, but Sheldon finds out and concocts an elaborate story to help him keep the secret from Raj."
        }
      },
      {
        "Episode 7": {
          "Title": "The Apology Insufficiency",
          "Description": "An FBI agent interviews the guys when Howard needs to obtain a security clearance."
        }
      },
      {
        "Episode 8": {
          "Title": "The 21-Second Excitation",
          "Description": "The guys camp out all night waiting to see an extended cut of Indiana Jones, while Amy joins in on girls' night with Penny and Bernadette."
        }
      },
      {
        "Episode 9": {
          "Title": "The Boyfriend Complexity",
          "Description": "Penny asks Leonard to pose as her boyfriend when her father visits. Howard, Raj and Bernadette have an awkward encounter when they spend the evening together."
        }
      },
      {
        "Episode 10": {
          "Title": "The Alien Parasite Hypothesis",
          "Description": "Amy discovers some unusual feelings and urges when she meets Penny's ex-boyfriend, Zack. Meanwhile, Howard and Raj argue over who would be a superhero and who would be their sidekick."
        }
      },
      {
        "Episode 11": {
          "Title": "The Justice League Recombination",
          "Description": "The guys enter a costume contest as members of the Justice League and convince Penny and Zack to join them."
        }
      },
      {
        "Episode 12": {
          "Title": "The Bus Pants Utilization",
          "Description": "Leonard has an idea for a new smartphone app and asks the guys for help, however Sheldon tries to take over the project, and Leonard fires him."
        }
      },
      {
        "Episode 13": {
          "Title": "The Love Car Displacement",
          "Description": "Chaos ensues when the gang spend the weekend together at a science convention."
        }
      },
      {
        "Episode 14": {
          "Title": "The Thespian Catalyst",
          "Description": "To improve his skills as an instructor, Sheldon asks Penny to give him acting lessons. Meanwhile, Raj begins having impure fantasies about Bernadette."
        }
      },
      {
        "Episode 15": {
          "Title": "The Benefactor Factor",
          "Description": "To secure needed funding for the university, Sheldon convinces Leonard to get friendly with a wealthy benefactor."
        }
      },
      {
        "Episode 16": {
          "Title": "The Cohabitation Formulation",
          "Description": "Bernadette makes Howard choose between herself and his mother, while Penny and Raj become upset when Priya returns to town and resumes her relationship with Leonard."
        }
      },
      {
        "Episode 17": {
          "Title": "The Toast Derivation",
          "Description": "Sheldon becomes concerned when everybody begins to hang out at Raj's apartment and discovers Leonard is the center of the group."
        }
      },
      {
        "Episode 18": {
          "Title": "The Prestidigitation Approximation",
          "Description": "Priya forces Leonard to choose between a relationship with her or a friendship with Penny. A magic trick by Howard has Sheldon fooled."
        }
      },
      {
        "Episode 19": {
          "Title": "The Zarnecki Incursion",
          "Description": "The guys go all out to help Sheldon find the person responsible for hacking his online gaming account, while the girls' hatred for Priya increases."
        }
      },
      {
        "Episode 20": {
          "Title": "The Herb Garden Germination",
          "Description": "Sheldon and Amy secretly experiment on the gang by spreading rumors when they hear that Bernadette is thinking about breaking up with Howard."
        }
      },
      {
        "Episode 21": {
          "Title": "The Agreement Dissection",
          "Description": "When Priya finds a loophole in the roommate agreement to throw Sheldon out for the night, Penny, Amy and Bernadette take him to a nightclub."
        }
      },
      {
        "Episode 22": {
          "Title": "The Wildebeest Implementation",
          "Description": "Sheldon invents a three-player chess game, Penny and Amy use Bernadette to spy on Leonard and Priya, and Raj tries a new drug to treat his social anxiety."
        }
      },
      {
        "Episode 23": {
          "Title": "The Engagement Reaction",
          "Description": "Howard believes that his mom suffered a heart attack because he told her that he's marrying Bernadette, Sheldon freaks out over germs, and Penny and Priya compare notes on Leonard."
        }
      },
      {
        "Episode 24": {
          "Title": "The Roommate Transmogrification",
          "Description": "Raj moves in with Sheldon after hearing Leonard and Priya engage in a Star Trek fantasy in his apartment. Bernadette receives her doctorate."
        }
      }
    ],
    "Season 5": [
      {
        "Episode 1": {
          "Title": "The Skank Reflex Analysis",
          "Description": "The gang deal with the fallout from Penny and Raj's night together."
        }
      },
      {
        "Episode 2": {
          "Title": "The Infestation Hypothesis",
          "Description": "Amy gets inadvertently caught in the middle of a fight between Sheldon and Penny over a chair. Leonard tries to add some spice to his long-distance relationship with Priya."
        }
      },
      {
        "Episode 3": {
          "Title": "The Pulled Groin Extrapolation",
          "Description": "Leonard accompanies Amy to a colleague's wedding. Howard tries to convince Bernadette to live with his mother after they get married."
        }
      },
      {
        "Episode 4": {
          "Title": "The Wiggly Finger Catalyst",
          "Description": "Penny sets up Raj with a deaf friend, not knowing that she's actually a gold digger, and Sheldon decides to let his minor decisions rest on the roll of the dice."
        }
      },
      {
        "Episode 5": {
          "Title": "The Russian Rocket Reaction",
          "Description": "Sheldon takes offense when Leonard wants to attend a party with Wil Wheaton, while Bernadette tries to block Howard's opportunity to go into outer space."
        }
      },
      {
        "Episode 6": {
          "Title": "The Rhinitis Revelation",
          "Description": "Sheldon gets upset when his mother comes to visit but refuses to cook for him and attend physics lectures."
        }
      },
      {
        "Episode 7": {
          "Title": "The Good Guy Fluctuation",
          "Description": "Sheldon tries to get into the spirit of Halloween by trying to scare the guys after they prank him. Leonard seeks Penny's advice when an attractive comic book artist takes an interest in him."
        }
      },
      {
        "Episode 8": {
          "Title": "The Isolation Permutation",
          "Description": "Amy is hurt when Penny and Bernadette go bridesmaid dress shopping without her, so she turns to a reluctant Sheldon for comfort."
        }
      },
      {
        "Episode 9": {
          "Title": "The Ornithophobia Diffusion",
          "Description": "Sheldon tries to overcome his fear of birds, while Leonard and Penny attempt to hang out together strictly as friends."
        }
      },
      {
        "Episode 10": {
          "Title": "The Flaming Spittoon Acquisition",
          "Description": "When Stuart asks Amy on a date, Sheldon considers having a more serious relationship with her. Meanwhile, the guys become obsessed with a new card game involving Wild West heroes and witches."
        }
      },
      {
        "Episode 11": {
          "Title": "The Speckerman Recurrence",
          "Description": "Leonard confronts the man who bullied him in high school, while Penny realizes she did her fair share of tormenting in the past."
        }
      },
      {
        "Episode 12": {
          "Title": "The Shiny Trinket Maneuver",
          "Description": "Penny helps Sheldon work on his relationship with Amy when he trivializes one of her accomplishments. Howard is irked by Bernadette's dislike of children."
        }
      },
      {
        "Episode 13": {
          "Title": "The Recombination Hypothesis",
          "Description": "Leonard and Penny contemplate reviving their romantic relationship."
        }
      },
      {
        "Episode 14": {
          "Title": "The Beta Test Initiation",
          "Description": "Leonard and Penny develop a system to ensure their dates go smoothly. Raj finally finds a woman he can talk to - the virtual assistant on his mobile phone."
        }
      },
      {
        "Episode 15": {
          "Title": "The Friendship Contraction",
          "Description": "Leonard signs out of his roommate agreement, reducing himself and Sheldon to mere acquaintances, while Howard tries to think of a cool astronaut nickname for himself."
        }
      },
      {
        "Episode 16": {
          "Title": "The Vacation Solution",
          "Description": "When the university forces Sheldon to use vacation days, he decides to hang out in Amy's lab. Howard becomes upset when he hears Bernadette wants him to sign a prenuptial agreement."
        }
      },
      {
        "Episode 17": {
          "Title": "The Rothman Disintegration",
          "Description": "Sheldon battles Kripke for a coveted office at the university. Penny receives a very unusual gift from Amy."
        }
      },
      {
        "Episode 18": {
          "Title": "The Werewolf Transformation",
          "Description": "Sheldon wreaks havoc when he tries to get a haircut from his regular barber, who is ill. Howard runs into a few problems with astronaut training."
        }
      },
      {
        "Episode 19": {
          "Title": "The Weekend Vortex",
          "Description": "Sheldon has to choose between joining Amy at her aunt's birthday party or playing videogames all weekend with the guys."
        }
      },
      {
        "Episode 20": {
          "Title": "The Transporter Malfunction",
          "Description": "Raj gets quite a surprise when he asks his parents to set him up on a date. Penny buys Leonard and Sheldon a pair of Star Trek keepsake collectibles."
        }
      },
      {
        "Episode 21": {
          "Title": "The Hawking Excitation",
          "Description": "Sheldon uses any and all means to meet his hero, Dr. Stephen Hawking."
        }
      },
      {
        "Episode 22": {
          "Title": "The Stag Convergence",
          "Description": "The guys throw Howard a bachelor party, and some embarrassing details about his life get posted on the Internet."
        }
      },
      {
        "Episode 23": {
          "Title": "The Launch Acceleration",
          "Description": "NASA cancel, and later reinstate Howard's mission into space, coinciding with his wedding. Leonard inadvertently jeopardizes his relationship with Penny."
        }
      },
      {
        "Episode 24": {
          "Title": "The Countdown Reflection",
          "Description": "As Howard prepares for his mission into space, flashbacks show the recent events leading up to his and Bernadette's wedding."
        }
      }
    ],
    "Season 6": [
      {
        "Episode 1": {
          "Title": "The Date Night Variable",
          "Description": "Raj crashes Sheldon and Amy's second anniversary and interferes in Leonard and Penny's relationship. Howard gets caught in the middle of an argument between Bernadette and his mother."
        }
      },
      {
        "Episode 2": {
          "Title": "The Decoupling Fluctuation",
          "Description": "Penny continues to have doubts about her relationship with Leonard. Meanwhile, Howard becomes the target of practical jokes on the space station."
        }
      },
      {
        "Episode 3": {
          "Title": "The Higgs Boson Observation",
          "Description": "When Sheldon hires a female grad student to assist him, a jealous Amy asks Penny to help her spy on them. On the space station, Howard begins behaving erratically."
        }
      },
      {
        "Episode 4": {
          "Title": "The Re-Entry Minimization",
          "Description": "Howard is offended when his return from space is met with little fanfare. Penny and Amy take on Sheldon and Leonard during game night."
        }
      },
      {
        "Episode 5": {
          "Title": "The Holographic Excitation",
          "Description": "While Raj plans Stuart's Halloween party at the comic book store, Howard annoys the rest of the gang by constantly talking about space, and Penny tries to take more of an interest in Leonard's work."
        }
      },
      {
        "Episode 6": {
          "Title": "The Extract Obliteration",
          "Description": "Penny enrolls in a college class and keeps it a secret from Leonard. Sheldon causes conflict with Dr. Stephen Hawking over an online game."
        }
      },
      {
        "Episode 7": {
          "Title": "The Habitation Configuration",
          "Description": "Howard makes a decision whether or not to move out of his mother's house, while Sheldon is caught in the middle of an argument between Amy and Wil Wheaton."
        }
      },
      {
        "Episode 8": {
          "Title": "The 43 Peculiarity",
          "Description": "Leonard feels threatened after hearing about Penny's study partner at school, while Howard and Raj become determined to find out one of Sheldon's secrets."
        }
      },
      {
        "Episode 9": {
          "Title": "The Parking Spot Escalation",
          "Description": "The gang are drawn into a fight between Howard and Sheldon over Sheldon's vacant parking spot at the university."
        }
      },
      {
        "Episode 10": {
          "Title": "The Fish Guts Displacement",
          "Description": "Howard tries to bond with Bernadette's father during a fishing trip. When Sheldon is obligated to take care of a sick Amy, she finds ways to take advantage of the situation."
        }
      },
      {
        "Episode 11": {
          "Title": "The Santa Simulation",
          "Description": "The girls take Raj out to a nightclub to find him a date. A game of Dungeons and Dragons rekindle old memories of Santa for Sheldon."
        }
      },
      {
        "Episode 12": {
          "Title": "The Egg Salad Equivalency",
          "Description": "When Penny finds out Alex has a crush on Leonard, Sheldon gets himself and the rest of the guys in trouble with Human Resources whilst trying to solve the problem."
        }
      },
      {
        "Episode 13": {
          "Title": "The Bakersfield Expedition",
          "Description": "The guys are stranded in the middle of nowhere when Leonard's car is stolen on the way to the Bakersfield Comic-Con. Back home, the girls try to figure out why the guys are so fascinated with comic books."
        }
      },
      {
        "Episode 14": {
          "Title": "The Cooper/Kripke Inversion",
          "Description": "Sheldon is forced to work with Kripke on a project and must concoct an elaborate lie when he can't hold up his end of the work. Howard and Raj get superhero figurines made of themselves."
        }
      },
      {
        "Episode 15": {
          "Title": "The Spoiler Alert Segmentation",
          "Description": "Leonard moves in with Penny after a fight with Sheldon, which causes Amy to want to move in with Sheldon. Meanwhile, Raj has a frightening experience with Howard's mother."
        }
      },
      {
        "Episode 16": {
          "Title": "The Tangible Affection Proof",
          "Description": "Sheldon gets Alex to buy a Valentine's Day gift for Amy. Leonard, Penny, Howard and Bernadette have a disastrous dinner together. Raj and Stuart host a 'Lonely People' party at the comic book store."
        }
      },
      {
        "Episode 17": {
          "Title": "The Monster Isolation",
          "Description": "Raj falls apart after his date sneaks out on him, and Sheldon reluctantly returns the favor after Penny helps him out with his 'Fun With Flags' program."
        }
      },
      {
        "Episode 18": {
          "Title": "The Contractual Obligation Implementation",
          "Description": "Leonard, Sheldon and Howard give lectures on science to junior high students. The girls ditch work to go to Disneyland. Raj devises a date for Lucy that fixes their social anxiety problems."
        }
      },
      {
        "Episode 19": {
          "Title": "The Closet Reconfiguration",
          "Description": "Howard becomes upset when Sheldon finds a letter from his estranged father whilst cleaning out his and Bernadette's closet."
        }
      },
      {
        "Episode 20": {
          "Title": "The Tenure Turbulence",
          "Description": "Leonard, Sheldon, Raj and Kripke battle for tenure at the university."
        }
      },
      {
        "Episode 21": {
          "Title": "The Closure Alternative",
          "Description": "Amy tries to help a depressed Sheldon find closure when one of his favorite TV shows is canceled. Raj becomes paranoid when he finds Lucy's blog."
        }
      },
      {
        "Episode 22": {
          "Title": "The Proton Resurgence",
          "Description": "Bernadette and Howard offer to watch Raj's dog and live to regret it. Leonard and Sheldon hire their favorite childhood star to make an appearance."
        }
      },
      {
        "Episode 23": {
          "Title": "The Love Spell Potential",
          "Description": "A date between Raj and Lucy takes both of them out of their comfort zones. After a trip to Las Vegas goes awry, the girls join in on a Dungeons and Dragons game, which causes Amy and Sheldon to re-evaluate their relationship."
        }
      },
      {
        "Episode 24": {
          "Title": "The Bon Voyage Reaction",
          "Description": "Penny is thrown for a loop when Leonard is offered a job overseas, but the news is an even bigger shock to Sheldon. Raj and Lucy's relationship comes to a crossroad."
        }
      }
    ],
    "Season 7": [
      {
        "Episode 1": {
          "Title": "The Hofstadter Insufficiency",
          "Description": "Sheldon and Penny bond over missing Leonard. Howard tries to help Raj get over his breakup with Lucy. Amy and Bernadette take a trip together to a biology convention."
        }
      },
      {
        "Episode 2": {
          "Title": "The Deception Verification",
          "Description": "Sheldon feels betrayed when Leonard returns from the North Sea and wants to spend his time with Penny instead of him. Howard's latest foray into helping his mother has some disastrous side effects."
        }
      },
      {
        "Episode 3": {
          "Title": "The Scavenger Vortex",
          "Description": "The gang get competitive when they are forced to take part in Raj's scavenger hunt."
        }
      },
      {
        "Episode 4": {
          "Title": "The Raiders Minimization",
          "Description": "Sheldon gets mad at Amy for ruining one of his favorite movies, Raj and Stuart try to make their online dating profiles more appealing, and Leonard tries to play the sympathy card with Penny."
        }
      },
      {
        "Episode 5": {
          "Title": "The Workplace Proximity",
          "Description": "After a fight with Bernadette, Howard ends up on Raj's couch. Sheldon and Amy clash when Amy takes a job at the university."
        }
      },
      {
        "Episode 6": {
          "Title": "The Romance Resonance",
          "Description": "Howard plans something special to celebrate the anniversary of his first date with Bernadette. Sheldon is conflicted when he makes a major scientific breakthrough but some details have to be corrected."
        }
      },
      {
        "Episode 7": {
          "Title": "The Proton Displacement",
          "Description": "Sheldon seeks payback when Arthur 'Professor Proton' Jeffries asks Leonard for help on a project instead of him. Raj gets upset at Howard for crashing his night with the girls."
        }
      },
      {
        "Episode 8": {
          "Title": "The Itchy Brain Simulation",
          "Description": "Sheldon demands Leonard make up for a mistake from their past. Penny confronts Raj's ex-girlfriend, Lucy."
        }
      },
      {
        "Episode 9": {
          "Title": "The Thanksgiving Decoupling",
          "Description": "The gang spend Thanksgiving at Mrs. Wolowitz's house. Howard tries to bond with his father-in-law, and a mistake from Penny's past comes back to haunt her."
        }
      },
      {
        "Episode 10": {
          "Title": "The Discovery Dissipation",
          "Description": "Leonard has to deal with the fallout of disproving Sheldon's new scientific discovery. Raj spends a week at Howard and Bernadette's apartment."
        }
      },
      {
        "Episode 11": {
          "Title": "The Cooper Extraction",
          "Description": "While Sheldon is at home in Texas, the rest of the gang decorate for Christmas and think about how much he has affected their lives."
        }
      },
      {
        "Episode 12": {
          "Title": "The Hesitation Ramification",
          "Description": "After Leonard tries to help Penny following a failed role on a TV show, she makes an important decision. Meanwhile, Raj and Stuart try to practice their social skills, and Sheldon navigates the intricacies of being funny."
        }
      },
      {
        "Episode 13": {
          "Title": "The Occupation Recalibration",
          "Description": "Sheldon tries to relax after he is forced to take a vacation. Leonard struggles to be supportive of Penny after she quits her job. Amy receives unwanted attention from a co-worker. Bernadette seeks Stuart's help in replacing one of Howard's comic books."
        }
      },
      {
        "Episode 14": {
          "Title": "The Convention Conundrum",
          "Description": "When the guys can't get hold of any Comic-Con tickets, Sheldon tries to hold his own convention and ends up spending a wild night with James Earl Jones. Meanwhile, the girls try to feel more mature by going to a fancy hotel for tea."
        }
      },
      {
        "Episode 15": {
          "Title": "The Locomotive Manipulation",
          "Description": "Sheldon and Amy take a train ride to Napa Valley with Howard and Bernadette on Valentine's Day. Leonard and Penny take Raj's dog to the vet when she accidentally eats some chocolate."
        }
      },
      {
        "Episode 16": {
          "Title": "The Table Polarization",
          "Description": "Leonard's purchase of a dining room table causes Sheldon to reevaluate the changes in his life. Meanwhile, Howard is offered a chance to go back to space and Bernadette struggles with whether or not to encourage him."
        }
      },
      {
        "Episode 17": {
          "Title": "The Friendship Turbulence",
          "Description": "After arguing with Sheldon, Howard tries to make amends by taking him to NASA headquarters in Houston. Penny has second thoughts about quitting her waitressing job when her car dies. Amy gets involved in trying to find Raj a date."
        }
      },
      {
        "Episode 18": {
          "Title": "The Mommy Observation",
          "Description": "When Sheldon visits his mother in Houston, he is forced to confront a new reality. Back in Pasadena, the rest of the gang reluctantly take part in Raj's Murder Mystery party."
        }
      },
      {
        "Episode 19": {
          "Title": "The Indecision Amalgamation",
          "Description": "While Raj is wracked with guilt when he tries to date Lucy and Emily at the same time, Penny wrestles with whether to take a role in a cheesy movie and Sheldon is torn trying to choose between two gaming systems."
        }
      },
      {
        "Episode 20": {
          "Title": "The Relationship Diremption",
          "Description": "Penny tries to help Sheldon when he reconsiders his 'relationship' with String Theory. During a dinner with Howard and Bernadette, Raj discovers Howard once embarrassed himself on a date with Emily."
        }
      },
      {
        "Episode 21": {
          "Title": "The Anything Can Happen Recurrence",
          "Description": "When Sheldon tries to be spontaneous, it leads to unexpected friction between the girls. Meanwhile, Raj seeks Howard's help in preparing for a date with Emily."
        }
      },
      {
        "Episode 22": {
          "Title": "The Proton Transmogrification",
          "Description": "As the gang celebrate Star Wars Day, Sheldon has difficulty dealing with the recent death of Arthur 'Professor Proton' Jeffries."
        }
      },
      {
        "Episode 23": {
          "Title": "The Gorilla Dissolution",
          "Description": "Penny gets fired from her movie and takes a serious look at her life. Raj sees Emily on a date with another man at the movies. Howard and Bernadette have to take care of his mother after she breaks her leg."
        }
      },
      {
        "Episode 24": {
          "Title": "The Status Quo Combustion",
          "Description": "Sheldon gets upset about his career, the destruction of the comic book store and Leonard and Penny's future living arrangements. Howard and Bernadette struggle to keep hold of a caregiver for Mrs. Wolowitz."
        }
      }
    ],
    "Season 8": [
      {
        "Episode 1": {
          "Title": "The Locomotion Interruption",
          "Description": "Sheldon's trip comes to an end when he is robbed, Penny interviews for a job at Bernadette's company, and Howard is weirded out by his mother's relationship with Stuart."
        }
      },
      {
        "Episode 2": {
          "Title": "The Junior Professor Solution",
          "Description": "Sheldon is forced to teach a class as a Junior Professor. Meanwhile, Amy plays both sides when tension arises between Penny and Bernadette."
        }
      },
      {
        "Episode 3": {
          "Title": "The First Pitch Insufficiency",
          "Description": "Howard becomes nervous after NASA asks him to throw out the first pitch at a Los Angeles Angels game. Meanwhile, Leonard and Penny try to prove Sheldon wrong when he says that he and Amy have a 'superior' relationship."
        }
      },
      {
        "Episode 4": {
          "Title": "The Hook-up Reverberation",
          "Description": "Raj's honesty about his past comes back to haunt him after Emily takes a dislike to Penny. Meanwhile, the guys consider investing in the comic book store."
        }
      },
      {
        "Episode 5": {
          "Title": "The Focus Attenuation",
          "Description": "The girls head to Las Vegas, while the guys try to invent something cool, but only come up with new ways to procrastinate."
        }
      },
      {
        "Episode 6": {
          "Title": "The Expedition Approximation",
          "Description": "Sheldon and Raj test whether they could survive a dark-matter research expedition in a salt mine by simulating the conditions in a steam tunnel. Meanwhile, Leonard and Penny seek advice from Howard and Bernadette when they argue about money."
        }
      },
      {
        "Episode 7": {
          "Title": "The Misinterpretation Agitation",
          "Description": "The guys befriend one of Penny's clients when he shows up at her apartment. Meanwhile, Bernadette gets upset when Amy torpedoes an article about her for a local magazine."
        }
      },
      {
        "Episode 8": {
          "Title": "The Prom Equivalency",
          "Description": "The girls decide to re-enact their high school proms with the guys. While Sheldon feels under pressure to commit to his relationship with Amy, Howard worries about who Stuart will bring as his date."
        }
      },
      {
        "Episode 9": {
          "Title": "The Septum Deviation",
          "Description": "Sheldon panics when Leonard announces he has to go into the hospital for surgery. Raj discovers his parents have divorced."
        }
      },
      {
        "Episode 10": {
          "Title": "The Champagne Reflection",
          "Description": "While Sheldon retires 'Fun With Flags', Leonard, Howard and Raj look for something significant in a dead professor's research, and Bernadette finds out what her colleagues really think of her."
        }
      },
      {
        "Episode 11": {
          "Title": "The Clean Room Infiltration",
          "Description": "Amy hosts a traditional Victorian Christmas Eve dinner as Raj's father comes to visit, while the guys try to shoo out a bird they let into the university clean room."
        }
      },
      {
        "Episode 12": {
          "Title": "The Space Probe Disintegration",
          "Description": "Raj worries a probe he designed will not work in outer space, while Leonard and Sheldon go shopping with Penny and Amy."
        }
      },
      {
        "Episode 13": {
          "Title": "The Anxiety Optimization",
          "Description": "When Sheldon becomes stuck in a rut with his work, the gang try to help him by raising his stress levels. Howard teases Raj with a game called 'Emily or Cinnamon.' When Sheldon becomes stuck in a rut with his work, the gang try to help him by raising his stress levels. Howard teases Raj with a game called 'Emily or Cinnamon.'"
        }
      },
      {
        "Episode 14": {
          "Title": "The Troll Manifestation",
          "Description": "Leonard and Sheldon defend themselves against criticism from an online bully, while the girls confront embarrassing moments from their pasts."
        }
      },
      {
        "Episode 15": {
          "Title": "The Comic Book Store Regeneration",
          "Description": "Howard receives some shocking news as everyone prepares for the re-opening of the comic book store. Meanwhile, Penny tries to teach Sheldon how to 'let it go,' but can't follow her own advice when she learns something infuriating about Amy."
        }
      },
      {
        "Episode 16": {
          "Title": "The Intimacy Acceleration",
          "Description": "Sheldon and Penny agree to participate in an unusual experiment. Leonard, Amy, Raj and Emily spend the evening trying to escape a room with a 'zombie'. Howard and Bernadette run into trouble at the airport after returning from Mrs. Wolowitz's funeral."
        }
      },
      {
        "Episode 17": {
          "Title": "The Colonization Application",
          "Description": "A trip to the pet store ends in a fight after Amy learns Sheldon has applied for a one-way mission to colonize Mars. Meanwhile, Leonard surprises Penny with a very 'adult' purchase, and Raj gets into trouble when he snoops around Emily's apartment."
        }
      },
      {
        "Episode 18": {
          "Title": "The Leftover Thermalization",
          "Description": "Tension arises when a magazine fails to mention Leonard in an article about the paper he co-wrote with Sheldon, and a blackout at Mrs. Wolowitz's home leads to a final family dinner in her honor."
        }
      },
      {
        "Episode 19": {
          "Title": "The Skywalker Incursion",
          "Description": "When Leonard and Sheldon are invited to speak at UC Berkeley, they take a detour to try and meet one of their idols. Meanwhile, while cleaning out Mrs. Wolowitz's house, a ping pong battle ensues when Howard and Bernadette argue over the fate of his TARDIS."
        }
      },
      {
        "Episode 20": {
          "Title": "The Fortification Implementation",
          "Description": "Howard meets the half-brother he never knew he had. Penny is invited to appear on Wil Wheaton's podcast."
        }
      },
      {
        "Episode 21": {
          "Title": "The Communication Deterioration",
          "Description": "When Raj is asked to create a message on the off chance a NASA mission discovers alien life, the guys fight over what he should do, while Penny contemplates returning to acting."
        }
      },
      {
        "Episode 22": {
          "Title": "The Graduation Transmission",
          "Description": "Howard questions his engineering abilities when he and Sheldon can't get a toy drone to fly. A cancelled flight nearly prevents Leonard from giving the commencement address at his former high school. Raj pits his parents against each other when his father cuts him off financially."
        }
      },
      {
        "Episode 23": {
          "Title": "The Maternal Combustion",
          "Description": "Personalities collide when Leonard and Sheldon's mothers meet for the first time. Bernadette reaches her limit with Howard and Stuart."
        }
      },
      {
        "Episode 24": {
          "Title": "The Commitment Determination",
          "Description": "As Sheldon presses Leonard and Penny to set a wedding date, he encounters major changes in his relationship with Amy. Meanwhile, Raj wonders if he should break up with Emily, and Howard and Bernadette struggle to ask Stuart to move out."
        }
      }
    ],
    "Season 9": [
      {
        "Episode 1": {
          "Title": "The Matrimonial Momentum",
          "Description": "Penny struggles with Leonard's confession that he kissed another woman as they prepare to get married in Las Vegas. Meanwhile, Sheldon doesn't know what to do after Amy pushes pause on their relationship."
        }
      },
      {
        "Episode 2": {
          "Title": "The Separation Oscillation",
          "Description": "Leonard and Penny try to work through their marital issues. Meanwhile, Sheldon films a special episode of 'Fun with Flags' after his breakup with Amy, and Bernadette feels guilty about withholding a secret from Penny."
        }
      },
      {
        "Episode 3": {
          "Title": "The Bachelor Party Corrosion",
          "Description": "The guys's skills are put to the test when they get a flat tire on the way to Mexico for Leonard's bachelor party. The girls throw Penny a mini-bachelorette party."
        }
      },
      {
        "Episode 4": {
          "Title": "The 2003 Approximation",
          "Description": "An impending change to his living arrangements inspires Sheldon to revert to 2003, before he met Penny and Leonard. Raj and Howard form a band for the comic book store."
        }
      },
      {
        "Episode 5": {
          "Title": "The Perspiration Implementation",
          "Description": "Kripke expresses interest in Amy while leading a fencing lesson for the guys. Meanwhile, Stuart seeks help from the girls in getting more women interested in the comic book store."
        }
      },
      {
        "Episode 6": {
          "Title": "The Helium Insufficiency",
          "Description": "Leonard and Sheldon go to great lengths to secure the helium they need during a nation-wide shortage. Meanwhile, the rest of the gang try to find Amy a new boyfriend on a dating app."
        }
      },
      {
        "Episode 7": {
          "Title": "The Spock Resonance",
          "Description": "While being interviewed for a documentary about Spock from Star Trek (1966), Sheldon struggles to suppress his emotions about his recent break-up from Amy. Meanwhile, Howard and Bernadette butt heads over renovating his mother's house."
        }
      },
      {
        "Episode 8": {
          "Title": "The Mystery Date Observation",
          "Description": "Sheldon, Howard and Raj post an ad online to find a new girlfriend for Sheldon. Penny and Bernadette decide to spy when Amy is secretive about who she is dating."
        }
      },
      {
        "Episode 9": {
          "Title": "The Platonic Permutation",
          "Description": "On Thanksgiving, Sheldon and Amy try to spend time together as friends and go to an aquarium, Howard reluctantly agrees to volunteer at the soup kitchen with Bernadette, Raj and Emily, and Penny discovers that Leonard knows more about her than she thought."
        }
      },
      {
        "Episode 10": {
          "Title": "The Earworm Reverberation",
          "Description": "Sheldon has a revelation when he realizes why a song was stuck in his head. Meanwhile, Amy invites Dave over for dinner despite their previously awkward date, and Howard and Raj become obsessed with a fan of their band."
        }
      },
      {
        "Episode 11": {
          "Title": "The Opening Night Excitation",
          "Description": "Leonard, Howard and Raj have to decide who will take their extra Star Wars movie ticket, while Sheldon plans something special for Amy's birthday."
        }
      },
      {
        "Episode 12": {
          "Title": "The Sales Call Sublimation",
          "Description": "Penny gets more than she bargained for when Leonard agrees to meet with a psychiatrist on her behalf to make a sale. Meanwhile, Sheldon and Raj collaborate on an astronomical discovery, and Howard and Bernadette's happiness is short-lived after Stuart moves out."
        }
      },
      {
        "Episode 13": {
          "Title": "The Empathy Optimization",
          "Description": "After being forced to deal with a sick Sheldon, the rest of the gang try to treat themselves to a Sheldon-free weekend."
        }
      },
      {
        "Episode 14": {
          "Title": "The Meemaw Materialization",
          "Description": "Sheldon is thrilled when his Meemaw comes to visit, but his excitement quickly fades when she butts heads with Amy. Meanwhile, Raj meets a girl at the comic book store who makes him question his relationship with Emily."
        }
      },
      {
        "Episode 15": {
          "Title": "The Valentino Submergence",
          "Description": "Sheldon and Amy host a Valentine's Day episode of 'Fun with Flags', Leonard and Penny grapple with getting older, Howard and Bernadette find a surprise in their hot tub and Raj is torn between Emily and Claire."
        }
      },
      {
        "Episode 16": {
          "Title": "The Positive Negative Reaction",
          "Description": "Bernadette reveals her pregnancy to Howard and the rest of the gang."
        }
      },
      {
        "Episode 17": {
          "Title": "The Celebration Experimentation",
          "Description": "The gang convinces Sheldon to celebrate his birthday and throw him a party."
        }
      },
      {
        "Episode 18": {
          "Title": "The Application Deterioration",
          "Description": "Leonard, Sheldon, and Howard run into problems when they file for a patent for their infinite persistence gyroscope. Meanwhile, the girls give Raj dating advice when Emily reaches out to him after their breakup."
        }
      },
      {
        "Episode 19": {
          "Title": "The Solder Excursion Diversion",
          "Description": "Amy is shocked at a revelation from Sheldon after she buys him a new laptop. Meanwhile, Raj sells out Leonard and Howard after they lie to their wives in order to attend an early screening of a movie."
        }
      },
      {
        "Episode 20": {
          "Title": "The Big Bear Precipitation",
          "Description": "Secrets are revealed when Amy and Sheldon join Penny and Leonard on a weekend cabin trip. Raj is more excited about Howard's and Bernadette's impending parenthood than they are."
        }
      },
      {
        "Episode 21": {
          "Title": "The Viewing Party Combustion",
          "Description": "The gang pick sides when a small argument between Leonard and Sheldon erupts into a heated fight during a 'Game of Thrones' viewing party."
        }
      },
      {
        "Episode 22": {
          "Title": "The Fermentation Bifurcation",
          "Description": "Sheldon and Bernadette spend the evening together while the rest of the gang go to a wine tasting party, but things get uncomfortable for Raj when Penny's ex-boyfriend Zack shows up and takes an interest in Claire."
        }
      },
      {
        "Episode 23": {
          "Title": "The Line Substitution Solution",
          "Description": "Sheldon hires Stuart to spend the day with Amy when he would rather go to the movies. Meanwhile, Penny struggles to make a connection with Leonard's mother when she comes to visit."
        }
      },
      {
        "Episode 24": {
          "Title": "The Convergence Convergence",
          "Description": "Leonard and Penny try to have a wedding ceremony that everyone can attend, but it creates serious conflict among Sheldon's mother and Leonard's divorced parents. Meanwhile, Howard and Raj become convinced the government is out to get them."
        }
      }
    ],
    "Season 10": [
      {
        "Episode 1": {
          "Title": "The Conjugal Conjecture",
          "Description": "As Leonard and Penny attempt to hold another wedding ceremony everyone can attend, they have to deal with Penny's family arriving and Leonard's father spending the night with Sheldon's mother."
        }
      },
      {
        "Episode 2": {
          "Title": "The Military Miniaturization",
          "Description": "Howard is visited by an Air Force colonel regarding his invention. Penny accidentally lets it slip about Bernadette's pregnancy to their co-workers."
        }
      },
      {
        "Episode 3": {
          "Title": "The Dependence Transcendence",
          "Description": "Bernadette confesses to Raj that she isn't sure if she's ready to be a mother, Penny accompanies Amy to a university mixer, and Sheldon goes to unusual extremes to assist Howard with his military project."
        }
      },
      {
        "Episode 4": {
          "Title": "The Cohabitation Experimentation",
          "Description": "When Amy must vacate her apartment for repairs, living arrangements are made with Leonard, Sheldon, and Penny. Howard and Bernadette don't want to know the sex of their baby, but Raj finds out."
        }
      },
      {
        "Episode 5": {
          "Title": "The Hot Tub Contamination",
          "Description": "Sheldon and Amy go through a period of adjustment with their new living arrangement. Howard and Bernadette are forced to vacation at home when she falls ill and keep it a secret, unaware Raj and Stuart planned to use their hot tub."
        }
      },
      {
        "Episode 6": {
          "Title": "The Fetal Kick Catalyst",
          "Description": "Sheldon and Amy host a brunch. Penny is surprised by her popularity when her movie, 'Serial Ape-Ist' is featured at a Van Nuys comic book convention. Howard starts to freak out about parenthood after feeling the baby kick for the first time."
        }
      },
      {
        "Episode 7": {
          "Title": "The Veracity Elasticity",
          "Description": "Amy doesn't tell Sheldon her apartment has been repaired. Leonard finds out Penny is slowly moving all of his collectible toys into storage."
        }
      },
      {
        "Episode 8": {
          "Title": "The Brain Bowl Incubation",
          "Description": "A successful gene experimentation leaves Sheldon excited to procreate with Amy, and he pulls out all stops to get her on board. Meanwhile, Raj takes an interest in the cleaning lady at the university."
        }
      },
      {
        "Episode 9": {
          "Title": "The Geology Elevation",
          "Description": "Sheldon can't contain his jealousy when Bert wins a grant for his geology research. A distasteful toy built by Howard faces judgement from the gang."
        }
      },
      {
        "Episode 10": {
          "Title": "The Property Division Collision",
          "Description": "Dividing up their possessions becomes an all-out war between Leonard and Sheldon. Stuart asks to live with Howard and Bernadette and tries to supplant Raj's efforts to help with the new baby."
        }
      },
      {
        "Episode 11": {
          "Title": "The Birthday Synchronicity",
          "Description": "Amy's desire to have an intimate night with Sheldon on her birthday is interrupted by Bernadette going into labor."
        }
      },
      {
        "Episode 12": {
          "Title": "The Holiday Summation",
          "Description": "After spending the holidays apart, the gang get together to hear about Sheldon's and Amy's trip to Texas, Leonard's and Penny's Christmas tree adventure, and Howard's and Bernadette's first days as parents."
        }
      },
      {
        "Episode 13": {
          "Title": "The Romance Recalibration",
          "Description": "Leonard and Penny ask for Sheldon's and Amy's help on putting the romance back in their marriage. Howard and Raj go to extreme lengths to stop the floor in Halley's bedroom from making noise."
        }
      },
      {
        "Episode 14": {
          "Title": "The Emotion Detection Automation",
          "Description": "Penny wants to help her brother get a job with her company. Sheldon learns of a machine that will help him understand human emotions. Raj reunites some of his old girlfriends to figure out why he is still single."
        }
      },
      {
        "Episode 15": {
          "Title": "The Locomotion Reverberation",
          "Description": "Leonard and Howard's attempt to keep Sheldon away from their Air Force project by sending him on a train trip backfires. Penny and Amy take Bernadette for her first night out since having the baby."
        }
      },
      {
        "Episode 16": {
          "Title": "The Allowance Evaporation",
          "Description": "Sheldon and Amy have their first fight since moving in together. Meanwhile Raj is shocked at the reality of financial independence when he stops receiving support from his father."
        }
      },
      {
        "Episode 17": {
          "Title": "The Comic-Con Conundrum",
          "Description": "The guys' annual trip to Comic Con is in doubt when Raj can't afford to go."
        }
      },
      {
        "Episode 18": {
          "Title": "The Escape Hatch Identification",
          "Description": "When the gang offer places for Raj to live, it creates unexpected conflict among everyone."
        }
      },
      {
        "Episode 19": {
          "Title": "The Collaboration Fluctuation",
          "Description": "Leonard, Penny and Raj adjust to their new living arrangements; Sheldon expresses an interest in Amy's work."
        }
      },
      {
        "Episode 20": {
          "Title": "The Recollection Dissipation",
          "Description": "Sheldon reaches his limit when he works on projects with Leonard, Howard and Amy in one day. Bernadette has doubts about leaving Halley when she goes back to work."
        }
      },
      {
        "Episode 21": {
          "Title": "The Separation Agitation",
          "Description": "Howard and Bernadette have a hard time leaving Halley in daycare when Bernadette returns to work. Bert introduces the gang to his new girlfriend."
        }
      },
      {
        "Episode 22": {
          "Title": "The Cognition Regeneration",
          "Description": "Leonard is less than thrilled when Penny considers accepting a job offer from her ex-boyfriend, Zack. Sheldon worries that he hasn't reached his full potential soon enough."
        }
      },
      {
        "Episode 23": {
          "Title": "The Gyroscopic Collapse",
          "Description": "After celebrating the completion of the top-secret Air Force project, Leonard, Sheldon and Howard get an unwelcome surprise; Amy receives an offer for a summer position at Princeton as a visiting researcher."
        }
      },
      {
        "Episode 24": {
          "Title": "The Long Distance Dissonance",
          "Description": "The gang become concerned when Sheldon's former admirer, Ramona Nowitzki, resurfaces while Amy is away at Princeton."
        }
      }
    ],
    "Season 11": [
      {
        "Episode 1": {
          "Title": "The Proposal Proposal",
          "Description": "Amy has trouble deciding whether or not she should marry Sheldon. Meanwhile, Bernadette confides in Penny when she finds out some huge news."
        }
      },
      {
        "Episode 2": {
          "Title": "The Retraction Reaction",
          "Description": "Leonard angers the University and the Physics Community when he gives an embarrassing radio interview. Bernadette and Amy compare their successes at work."
        }
      },
      {
        "Episode 3": {
          "Title": "The Relaxation Integration",
          "Description": "Sheldon and Amy struggle with picking a wedding date. Meanwhile, Stuart and Raj fight over one of Bernadette's co-workers for a date."
        }
      },
      {
        "Episode 4": {
          "Title": "The Explosion Implosion",
          "Description": "Howard and Bernadette are disappointed when they find out the sex of the baby. Leonard is annoyed when his mother befriends Penny."
        }
      },
      {
        "Episode 5": {
          "Title": "The Collaboration Contamination",
          "Description": "Amy and Howard work in the lab together causing Sheldon, Bernadette and Raj to feel jealous and lonely. Penny starts using a parenting book to control Sheldon's behavior."
        }
      },
      {
        "Episode 6": {
          "Title": "The Proton Regeneration",
          "Description": "Sheldon and Wil Wheaton both go head-to-head for the role of the new Professor Proton, Meanwhile Penny takes care of Halley when Bernadette and Howard are on bed rest."
        }
      },
      {
        "Episode 7": {
          "Title": "The Geology Methodology",
          "Description": "When Bert asks Sheldon to collaborate on a project with him, Sheldon becomes worried about others finding out because he thinks geology is beneath him. Raj seeks advice after reconnecting with Ruchi."
        }
      },
      {
        "Episode 8": {
          "Title": " The Tesla Recoil",
          "Description": "Howard and Leonard become upset after they discover that Sheldon has been working with the military without telling them; Bernadette asks Raj to investigate her suspicions that Ruchi is attempting to take her job away from her."
        }
      },
      {
        "Episode 9": {
          "Title": "The Bitcoin Entanglement",
          "Description": "Sheldon tries to teach the other guys a lesson after they cut him out of a potentially valuable Bitcoin investment seven years ago."
        }
      },
      {
        "Episode 10": {
          "Title": "The Confidence Erosion",
          "Description": "Sheldon and Amy try to eliminate stress from wedding planning by applying math to the process. Raj and Howard come to blows when Raj begins to feel like Howard hurts his confidence."
        }
      },
      {
        "Episode 11": {
          "Title": "The Celebration Reverberation",
          "Description": "Raj and Howard's feud continues as the gang plan Halley's first birthday party. Sheldon's surprise for Amy's birthday goes awry when they get food poisoning."
        }
      },
      {
        "Episode 12": {
          "Title": "The Matrimonial Metric",
          "Description": "Sheldon and Amy pick their best-man and maid of honor by experimenting on the gang. Meanwhile, Leonard's self-confidence is still badly damaged after reading his brother's Christmas letter."
        }
      },
      {
        "Episode 13": {
          "Title": "The Solo Oscillation",
          "Description": "Sheldon kicks Amy out of the apartment to work solo, and she and Leonard end up bonding during a series of science experiments; Howard is replaced by Bert in Footprints on the Moon."
        }
      },
      {
        "Episode 14": {
          "Title": "The Separation Triangulation",
          "Description": "Raj meets a girl at the Planetarium, but soon after finds out she is married. Sheldon rents out his old room to use for his work."
        }
      },
      {
        "Episode 15": {
          "Title": "The Novelization Correlation",
          "Description": "Leonard's book raises questions, and Amy guest stars on the new Professor Proton show."
        }
      },
      {
        "Episode 16": {
          "Title": "The Neonatal Nomenclature",
          "Description": "When Bernadette won't go into labor, the gang try different tactics to get things started. Also, Wolowitz confronts Bernadette after Amy accidentally reveals she's already chosen their son's name."
        }
      },
      {
        "Episode 17": {
          "Title": "The Athenaeum Allocation",
          "Description": "Leonard jumps through hoops to help secure the perfect wedding venue for Sheldon and Amy. Also, Bernadette and Wolowitz have a hard time deciding who should stay at home with the kids and who should go back to work."
        }
      },
      {
        "Episode 18": {
          "Title": "The Gates Excitation",
          "Description": "Leonard, Howard and Raj try to meet Bill Gates, who's meeting with Penny to merge their companies; Sheldon thinks he's the victim of an April Fool's prank."
        }
      },
      {
        "Episode 19": {
          "Title": "The Tenant Disassociation",
          "Description": "Leonard runs against Sheldon to be president of the tenants association; Wolowitz and Koothrappali find a drone in the backyard."
        }
      },
      {
        "Episode 20": {
          "Title": "The Reclusive Potential",
          "Description": "Sheldon takes the guys to a cabin in the middle of nowhere to meet a reclusive scientist; Penny and Bernadette improvise Amy's bachelorette party."
        }
      },
      {
        "Episode 21": {
          "Title": "The Comet Polarization",
          "Description": "Sheldon's comic book store experience changes when writer Neil Gaiman puts Stuart's store on the map; friendships are threatened when Koothrappali takes credit for Penny's astronomical discovery."
        }
      },
      {
        "Episode 22": {
          "Title": "The Monetary Insufficiency",
          "Description": "Sheldon goes to Vegas to win money for science. Also, Penny and Bernadette take Amy wedding dress shopping, but her terrible choice entangles them in a web of lies."
        }
      },
      {
        "Episode 23": {
          "Title": "The Sibling Realignment",
          "Description": "Sheldon and Leonard make a road trip to wrangle a reluctant wedding guest."
        }
      },
      {
        "Episode 24": {
          "Title": "The Bow Tie Asymmetry",
          "Description": "When Amy's parents and Sheldon's family arrive, everybody is focused to make sure all wedding arrangements go according to plan - everyone except the bride and groom."
        }
      }
    ],
    "Season 12": [
      {
        "Episode 1": {
          "Title": "The Conjugal Configuration",
          "Description": "After their wedding, Amy and Sheldon go on their honeymoon."
        }
      },
      {
        "Episode 2": {
          "Title": "The Wedding Gift Wormhole",
          "Description": "Leonard and Penny give Sheldon and Amy a baffling wedding gift."
        }
      },
      {
        "Episode 3": {
          "Title": "The Procreation Calculation",
          "Description": "The Wolowitzes' life gets complicated when Stuart starts bringing his new girlfriend home. Also, Penny and Leonard talk about starting a family while Koothrappali explores an arranged marriage."
        }
      },
      {
        "Episode 4": {
          "Title": "The Tam Turbulence",
          "Description": "Sheldon won't tell anyone why he's never mentioned Tam, his childhood best friend, so Leonard takes matters into his own hands. Also, Bernadette and Penny take out Raj's fiance, Anu, for dinner to get the skinny on her."
        }
      },
      {
        "Episode 5": {
          "Title": "The Planetarium Collision",
          "Description": "Amy doesn't have time to work with Sheldon on super asymmetry, so he goes to great lengths to ensure she's available. Koothrappali doesn't want Wolowitz to join him in hosting a show at the planetarium."
        }
      },
      {
        "Episode 6": {
          "Title": "The Imitation Perturbation",
          "Description": "When Wolowitz dresses up as Sheldon for Halloween, Sheldon seeks retaliation at Leonard and Penny's Halloween party. Also, Leonard is shocked that Penny doesn't remember their first kiss."
        }
      },
      {
        "Episode 7": {
          "Title": "The Grant Allocation Derivation",
          "Description": "Leonard is caught between a rock and a hard place when he's responsible for distributing extra grant money. Also, Bernadette turns the backyard playhouse into a hideaway from her husband and kids."
        }
      },
      {
        "Episode 8": {
          "Title": "The Consummation Deviation",
          "Description": "Sheldon tries to bond with Amy's father, but when Wolowitz lures Mr. Fowler away with magic tricks, Sheldon has no choice but to bond with Mrs. Fowler. Also, Koothrappali and Anu try to get physical for the first time."
        }
      },
      {
        "Episode 9": {
          "Title": "The Citation Negation",
          "Description": "Sheldon and Amy are devastated after learning from a Russian paper that super asymmetry has already been theorized and disproved. Bernadette wants to beat Howard in a popular video game."
        }
      },
      {
        "Episode 10": {
          "Title": "The VCR Illumination",
          "Description": "A VHS tape from Sheldon's past inspires him and Amy not to give up when they're still feeling down about their theory being disproven. Bernadette turns into a pageant mom when she tries to help Howard with his Magic Castle audition."
        }
      },
      {
        "Episode 11": {
          "Title": "The Paintball Scattering",
          "Description": "Penny and Leonard organize a paintball game, which results in mayhem when Sheldon becomes jealous of Amy. Raj catches Anu with her ex-boyfriend. Stuart doesn't want to move in with Denise."
        }
      },
      {
        "Episode 12": {
          "Title": "The Propagation Proposition",
          "Description": "Penny's ex-boyfriend Zack learns that he is infertile, so he asks Leonard for help; Koothrappali attempts to mend things with his ex-fiancee Anu."
        }
      },
      {
        "Episode 13": {
          "Title": "The Confirmation Polarization",
          "Description": "Sheldon and Amy are thrilled when their super asymmetry theory is proven by two physicists, until they try to kick Amy off the Nobel nomination. Bernadette gets one of her drugs approved and wants a reluctant Penny to head the sales team."
        }
      },
      {
        "Episode 14": {
          "Title": "The Meteorite Manifestation",
          "Description": "Sheldon is thrilled to help Bernadette and Howard navigate bureaucracy concerning a neighbor's non-compliant balcony until he learns they too have ignored codes. Leonard is disappointed when his friends are uninterested in his new laser."
        }
      },
      {
        "Episode 15": {
          "Title": "The Donation Oscillation",
          "Description": "Penny tries to throw a wrench into Leonard's plan to be a sperm donor for her ex-boyfriend; Wolowitz, Bernadette, Anu and Koothrappali turn Koothrappali's canceled bachelor party into a couple's trip aboard the 'vomit comet.'"
        }
      },
      {
        "Episode 16": {
          "Title": "The D & D Vortex",
          "Description": "The gang finds out Wil Wheaton hosts a celebrity Dungeons and Dragons game involving William Shatner, Joe Manganiello, Kareem Abdul-Jabbar and Kevin Smith. Deception and betrayal are the path to make it to the one open seat."
        }
      },
      {
        "Episode 17": {
          "Title": "The Conference Valuation",
          "Description": "Bernadette and Penny travel to San Diego for a pharmaceutical sales convention. Back home, Amy and the guys experiment on the Wolowitz children when Sheldon finds a book on it."
        }
      },
      {
        "Episode 18": {
          "Title": "The Laureate Accumulation",
          "Description": "Rivals Pemberton and Campbell charm America on a publicity tour so Sheldon and Amy try to win over Nobel laureates Kip Thorne, George Smoot and Frances Arnold. Halley's fear of the dark causes opportunity and conflict at the Wolowitz home."
        }
      },
      {
        "Episode 19": {
          "Title": "The Inspiration Deprivation",
          "Description": "Contemplating what it would mean to all women if she were to win a Nobel Prize causes Amy to have a meltdown. Koothrappali and Wolowitz try to relive the good old days after Wolowitz buys a scooter that looks like the one he had years ago."
        }
      },
      {
        "Episode 20": {
          "Title": "The Decision Reverberation",
          "Description": "Koothrappali is worried people won't take him seriously in his own field after publishing a paper that suggests he may have discovered alien life. Leonard wants to be the principal investigator on a plasma physics study."
        }
      },
      {
        "Episode 21": {
          "Title": "The Plagiarism Schism",
          "Description": "Kripke has proof that Dr. Pemberton plagiarized his thesis in college, and Sheldon and Amy aren't sure if they should turn him in. Wolowitz learns that Bernadette wasn't the only waitress at the Cheesecake Factory who had a crush on him."
        }
      },
      {
        "Episode 22": {
          "Title": "The Maternal Conclusion",
          "Description": "Leonard is pleasantly surprised when Beverly comes to visit and she's genuinely kind to him, until he finds out the real reason she's there. Also, Denise and Stuart overstay their welcome at the Wolowitz house."
        }
      },
      {
        "Episode 23": {
          "Title": "The Change Constant",
          "Description": "Sheldon and Amy await big news."
        }
      },
      {
        "Episode 24": {
          "Title": "The Stockholm Syndrome",
          "Description": "Bernadette and Wolowitz leave their kids for the first time; Penny and Leonard try to keep a secret; Sheldon and Amy stick together; and Koothrappali makes a new friend, as the gang travels together into an uncharted future."
        }
      }
    ]
  }
}